SPedt/src/Documents/Расходная/Расходная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Расходная</name>
  <registerRecords>InformationRegister.ОбменССайтом</registerRecords>
  <registerRecords>AccumulationRegister.Расход</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <registerRecords>AccumulationRegister.Обмен100СПрн</registerRecords>
  <registerRecords>AccumulationRegister.Обмен100СПрн_Ошибки</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыНаСкладах</registerRecords>
  <registerRecords>InformationRegister.Обмен100сп</registerRecords>
  <registerRecords>AccumulationRegister.Транзит</registerRecords>
  <registerRecords>InformationRegister.Обмен100спСообщения</registerRecords>
  <registerRecords>AccumulationRegister.КПолучению</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.Возвраты</registerRecords>
  <attributes>
    <name>Участник</name>
    <type>
      <types>CatalogRef.Участники</types>
    </type>
  </attributes>
  <attributes>
    <name>Списать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Напечатано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоискНикаСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автозаполнение</name>
    <type>
      <types>CatalogRef.ГруппыУчастников</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьИтого</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредоплатаОрганизатор</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредоплатаУчастник</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьСкидки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусВыдачи</name>
    <type>
      <types>EnumRef.СтатусыВыдачиПокупок</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоискЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КартаУчастника</name>
    <type>
      <types>CatalogRef.КартыУчастников</types>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОплаты</name>
    <type>
      <types>EnumRef.ФормыОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЧекаККМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСменыККМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусККМ</name>
    <type>
      <types>EnumRef.СтатусыЧековККМ</types>
    </type>
  </attributes>
  <attributes>
    <name>Архивный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОплатаВыполнена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылочныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерКарты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПробитЧекОтмены</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Покупки</name>
    <attributes>
      <name>Потерян</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Покупка</name>
      <type>
        <types>CatalogRef.Покупки</types>
        <types>CatalogRef.Заказы</types>
        <types>CatalogRef.Посылки</types>
        <types>CatalogRef.Пристрой</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПокупкаСпр</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Оплачен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>МестоХранения</name>
      <type>
        <types>CatalogRef.МестаХранения</types>
      </type>
    </attributes>
    <attributes>
      <name>Габарит</name>
      <type>
        <types>CatalogRef.Габариты</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяХранения</name>
      <comment>в днях</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>DocumentRef.Движение</types>
        <types>DocumentRef.КорректировкаЗаписейРегистров</types>
        <types>DocumentRef.Приходная</types>
        <types>DocumentRef.ПоступлениеПристроя</types>
        <types>DocumentRef.РазборКоробки</types>
      </type>
    </attributes>
    <attributes>
      <name>Оплатить</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КодЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШК</name>
      <type>
        <types>CatalogRef.Мегаордера</types>
      </type>
    </attributes>
    <attributes>
      <name>ПерваяТочка</name>
      <type>
        <types>CatalogRef.ТочкиРаздачи</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПраздничныхДней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьХранения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьДоставки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьИтого</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОплачиваетОрганизатор</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОплачиваетУчастник</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БесплатнаяВыдача</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОплаченоУчастником</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Надбавка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.КартыУчастников</types>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SPedt/src/AccumulationRegisters/ОстаткиТоваров/ОстаткиТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиТоваров</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Покупка</name>
    <type>
      <types>DefinedType.ТипыЗаказа</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Участник</name>
    <type>
      <types>CatalogRef.Участники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Габарит</name>
    <type>
      <types>CatalogRef.Габариты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Оплачен</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DocumentRef.Движение</types>
      <types>DocumentRef.КорректировкаЗаписейРегистров</types>
      <types>DocumentRef.Приходная</types>
      <types>DocumentRef.ПоступлениеПристроя</types>
      <types>DocumentRef.РазборКоробки</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

SPedt/src/AccumulationRegisters/Расход/Расход.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Расход</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Предоплата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Покупка</name>
    <type>
      <types>DefinedType.ТипыЗаказа</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DefinedType.ПартияДляОбмена</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Габарит</name>
    <type>
      <types>CatalogRef.Габариты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Участник</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
      <types>CatalogRef.Участники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Списано</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипРасхода</name>
    <type>
      <types>EnumRef.ТипРасхода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>БесплатнаяВыдача</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПредоплаченоУчастником</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>пристрой</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

SPedt/src/Documents/Расходная/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	
	#Область ПравильноеПроведение
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, Режим);
	Документы.Расходная.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	ДополнительныеСвойства.Вставить("ЭтоНовый",ЭтоНовый());
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	СП_ДвиженияСервер.ПровестиПроверитьОтрицательныеОстаткиОстаткиТоваров(ДополнительныеСвойства,Движения, Отказ);
	Если Отказ Тогда Возврат; КонецЕсли;

	СтоСПОбмен_Общий.ОтразитьСтоСПОбмен_РН(ДополнительныеСвойства, Движения, Отказ);
	СП_ДвиженияСервер.ОтразитьПродажи(ДополнительныеСвойства, Движения, Отказ);
    СП_ДвиженияСервер.ОтразитьРасход(ДополнительныеСвойства, Движения, Отказ);
	ПроведениеСерверСП.ОтразитьДвиженияПоТаблице(ДополнительныеСвойства, Движения, "ТоварыНаСкладах", Отказ);
	
	#КонецОбласти
	
	
		
	Движения.ОстаткиТоваров.Записывать = Истина;
	Движения.Расход.Записывать = Истина;

	

		
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)   
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения и 
		ПараметрыСеанса.РазрешитьИзменения <> Ссылка и 
		не Константы.РасходнаяПометкаНаУдаление.Получить() Тогда
		Отказ =  Истина;
		Возврат;
	Иначе
		УстановитьПривилегированныйРежим(Истина);
		ПараметрыСеанса.РазрешитьИзменения = Документы.Расходная.ПустаяСсылка();;
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
//	Если ВидОплаты = Перечисления.ФормыОплаты.ПлатежнаяКарта и 
//		не ЗначениеЗаполнено(НомерКарты) и 
//		не константы.ПлатежныйТерминалБезПодключения.Получить() Тогда
//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выбран вид оплаты ""Платежная карта"", но оплата не выполнена");
//		Отказ =  истина;
//		
//		
//	КонецЕсли;
	
	Если аСППрверки.ПроверитьБлокировкуУчастника(Участник) и РежимЗаписи<>РежимЗаписиДокумента.ОтменаПроведения  Тогда
		Отказ = Истина;
	КонецЕсли;
	ЗаполнитьШК(Покупки);
КонецПроцедуры


Процедура ЗаполнениеКодов() Экспорт
	для Каждого стр из Покупки Цикл
		стр.КодЗаказа	= ПолучитьКодВыдачиПокупки(стр.Покупка, Участник);
	КонецЦикла;	
КонецПроцедуры	

Функция 	ЗаполнитьОстатками(Период = Неопределено, ПомечатьСтроки = Ложь) Экспорт
	Если Период = Неопределено Тогда
		ДатаДокумента = КонецДня(Дата);
	Иначе	
		ДатаДокумента = Период;		
	КонецЕсли;	
	тз = СП_РаботаСДокументами.ТаблицаРасходной(ДатаДокумента,Участник);
	ЗаполнитьГородаСП(ТЗ);
	ЗаполнитьШК(Тз);
	Покупки.Очистить();
	Для каждого стр из ТЗ Цикл
		КодЗаказа = ПолучитьКодВыдачиПокупки(стр.Покупка, Участник);
		если стр.негабарит Тогда 
			новСтрока					= Покупки.Добавить();			
			ЗаполнитьЗначенияСвойств(новСтрока,стр);
			новСтрока.КодЗаказа			= КодЗаказа;
		Иначе
			Для инд=1 по стр.Количество Цикл
				новСтрока				=Покупки.Добавить();
				ЗаполнитьЗначенияСвойств(новСтрока,стр);
				новСтрока.КодЗаказа		= КодЗаказа;
				новСтрока.Количество	= 1;
			КонецЦикла;
		КонецЕсли
	КонецЦикла;
	
	Для каждого стр из Покупки Цикл
		Если стр.БесплатнаяВыдача Тогда
			Если стр.ОплаченоУчастником Тогда
				ПредоплатаУчастник = ПредоплатаУчастник+ стр.ОплачиваетОрганизатор;	
			Иначе
				ПредоплатаОрганизатор = ПредоплатаОрганизатор+ стр.ОплачиваетОрганизатор;	
			КонецЕсли;
		КонецЕсли;
		стр.Подбор = ПомечатьСтроки;
	КонецЦикла;	
	Если ПомечатьСтроки И Покупки.Количество()>0 Тогда
		ВидОплаты = Перечисления.ФормыОплаты.Наличные;
		ПоискЗаказа = стр.КодЗаказа; 
		РассчитатьСтоимость();
	КонецЕсли;

//	СтоимостьИтого 					= Покупки.Итог("СтоимостьИтого") - ПредоплатаОрганизатор - ПредоплатаУчастник + ПоискНикаСтоимость;

КонецФункции

Процедура РассчитатьСтоимость()
	СтоимостьИтого	= 0;
	ПредоплатаОрганизатор=0;							         
	ПредоплатаУчастник = 0;

	
	Для каждого стр из Покупки Цикл
		
		СтоимостьИтого	= СтоимостьИтого + 	стр.ОплачиваетУчастник;
		Если стр.БесплатнаяВыдача Тогда
			Если стр.ОплаченоУчастником Тогда
				ПредоплатаУчастник = ПредоплатаУчастник+ стр.ОплачиваетОрганизатор;	
			Иначе
				ПредоплатаОрганизатор = ПредоплатаОрганизатор+ стр.ОплачиваетОрганизатор;	
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Для каждого стр из Товары Цикл	
		СтоимостьИтого	= СтоимостьИтого + стр.Сумма;
	КонецЦикла;	
	ВыбранныеПосылки = Покупки.найтистроки(Новый Структура("Подбор", Истина));
	Если ВыбранныеПосылки.Количество()>0 Тогда
		СтоимостьИтого	= СтоимостьИтого + ПоискНикаСтоимость;
	КонецЕсли;		
	Если Списать Тогда
		СтоимостьИтого	= 0;
	КонецЕсли;	
	КоличествоПомеченныхСтрок	= ВыбранныеПосылки.Количество();
КонецПроцедуры


функция ПолучитьКодВыдачиПокупки(Покупка, Участник)
	Если (	ТипЗнч(Покупка)=Тип("СправочникСсылка.Покупки") или
			ТипЗнч(Покупка)=Тип("СправочникСсылка.Пристрой"))  и
			ЗначениеЗаполнено(Покупка.secureCode) Тогда
		х			= новый ХешированиеДанных(ХешФункция.CRC32);
		х.Добавить(СтрЗаменить(Строка(Покупка.Код)+"_"+Строка(Участник.Код)+"_"+Покупка.secureCode," ",""));
		КодВыдачи	= Лев(СтрЗаменить(Строка(х.ХешСумма)," ",""),4);
	ИначеЕсли ТипЗнч(Покупка)=Тип("СправочникСсылка.Посылки") и ЗначениеЗаполнено(Покупка.secureCode)  Тогда
		КодВыдачи = Покупка.secureCode;
	Иначе 
		КодВыдачи = "Нет кода!";		
	КонецЕсли;	
	Возврат КодВыдачи;
КонецФункции	


Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	массСтрок = покупки.НайтиСтроки(новый структура("Оплачен",Ложь));
	Для каждого элем из массСтрок Цикл
		Если элем.Оплатить Тогда Продолжить КонецЕсли;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Позиция № """+элем.НомерСтроки+
		""" не оплачена ";
		Сообщение.Поле="Заказы["+(элем.НомерСтроки-1)+"].Оплачен";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		Отказ=Истина;		
	КонецЦикла	
	
	//Запрос = Новый Запрос;
	//Запрос.Текст =          //Проверка оплачен.неоплачен
	//	"ВЫБРАТЬ
	//	|	РасходнаяПокупки.НомерСтроки,
	//	|	РасходнаяПокупки.МестоХранения,
	//	|	РасходнаяПокупки.Покупка,
	//	|	РасходнаяПокупки.Количество
	//	|ИЗ
	//	|	Документ.Расходная.Покупки КАК РасходнаяПокупки
	//	|Где Ссылка=&Ссылка И НЕ РасходнаяПокупки.Оплачен 
	//	|И НЕ РасходнаяПокупки.Оплатить
	//	|И НЕ РасходнаяПокупки.Потерян";
	//Запрос.УстановитьПараметр("Ссылка",Ссылка);	
	//Результат = Запрос.Выполнить();

	//Выборка = Результат.Выбрать();

	//Пока Выборка.Следующий() Цикл
	//		Сообщение = Новый СообщениеПользователю;
	//		Сообщение.Текст = "Позиция № """+Выборка.НомерСтроки+
	//		 	""" не оплачена ";
	//		Сообщение.Поле="Заказы["+(Выборка.НомерСтроки-1)+"].Оплачен";
	//		Сообщение.УстановитьДанные(ЭтотОбъект);
	//		Сообщение.Сообщить();
	//		Отказ=Истина;
	//КонецЦикла;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	НомерЧекаККМ=0;
	НомерСменыККМ=0;
	
	Архивный=Ложь;
	СтатусККМ=Перечисления.СтатусыЧековККМ.ПустаяСсылка();
	Напечатано=Ложь;
КонецПроцедуры


Процедура ЗаполнитьШК(Тз)
	массСтрок=Тз.НайтиСтроки(Новый Структура("ШК",Справочники.Мегаордера.ПустаяСсылка()));
	Свояточка=Константы.СвояТочка.Получить();
	Для каждого стр из массСтрок Цикл
		стр.ШК	= СП_Штрихкоды.ПолучитьМегаордер(стр.Покупка,Участник,Константы.СвояТочка.Получить());
	КонецЦикла;
КонецПроцедуры	

Процедура ЗаполнитьГородаСП(ТЗ)
	массШКБезГорода=тз.НайтиСтроки(новый Структура("ГородСП",Справочники.ГородаСП.ПустаяСсылка()));
	Если массШКБезГорода.количество()>0 Тогда
		сисокШК=новый СписокЗначений;
		Для каждого элем из массШКБезГорода Цикл
			сисокШК.Добавить(элем.ШК);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры	

Функция ДобавитьТовар(Товар) Экспорт
	Если ТипЗнч(Товар) = Тип("СправочникСсылка.КартыУчастников") Тогда
		строка_товар 				= Товары.Добавить();
		строка_товар.Номенклатура 	= Товар;
		строка_товар.Количество 	= 1;
		строка_товар.Цена  			= Константы.СтоимостьКартыУчастника.Получить();
		строка_товар.Сумма  		= строка_товар.Цена*строка_товар.Количество;
		
		СтоимостьИтого=Покупки.Итог("ОплачиваетУчастник")+ПоискНикаСтоимость+Товары.Итог("Сумма");
		Возврат Истина;
	ИначеЕсли ТипЗнч(Товар) = Тип("СправочникСсылка.Номенклатура") Тогда
		масс_Строк = Товары.НайтиСтроки(новый Структура("Номенклатура",Товар));
		Если масс_Строк.Количество()>0 тогда
			стр_товара = масс_Строк[0];
			количество_до = стр_товара.Количество;
		Иначе	
			стр_товара = Товары.Добавить();
			количество_до = 0;
		Конецесли;	
		стр_товара.Номенклатура	= Товар;
		стр_товара.Количество 	= количество_до + 1;
		стр_товара.Цена  		= Товар.Цена;
		стр_товара.Сумма  		= стр_товара.Цена*стр_товара.Количество;
	    СтоимостьИтого=Покупки.Итог("ОплачиваетУчастник")+ПоискНикаСтоимость+Товары.Итог("Сумма");

		Возврат Истина;
	КонецЕсли;
	Возврат Ложь;
КонецФункции
